Revit 2024 API
IExportContext.IsCanceled Method
 This method is queried at the beginning of every element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
bool IsCanceled()
Visual Basic
Function IsCanceled As Boolean
Visual C++
bool IsCanceled()
Return Value
 Return True if you wish to cancel the exporting process, or False otherwise.
See Also
IExportContext Interface
Autodesk.Revit.DB Namespace